sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXA176
package_id: MCXA176VLH
mcu_data: ksdk2_0
processor_version: 26.03.20
external_user_signals: {}
pin_labels:
- {pin_num: '15', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/FLEXIO0_D9/SmartDMA_PIO25/ADC1_A0, label: ADC_IN1, identifier: ADC_IN1}
- {pin_num: '19', pin_signal: P2_5/LPUART2_RTS_B/CT_INP15/CT1_MAT1/FLEXIO0_D13/SmartDMA_PIO29/ADC1_A1, label: ADC_IN2, identifier: ADC_IN2}
- {pin_num: '27', pin_signal: USB0_DP/WUU0_IN29, label: ADC_IN3, identifier: ADC_IN3}
- {pin_num: '20', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/FLEXIO0_D14/SmartDMA_PIO30/ADC1_A3, label: ADC_IN4, identifier: ADC_IN4}
- {pin_num: '23', pin_signal: P2_13/TRIG_IN8/LPSPI1_SDO/LPUART1_TXD/CT4_MAT1/CT0_MAT1/FLEXIO0_D21/SmartDMA_PIO17/CAN0_TXD/ADC1_A5/OPAMP0_INN, label: ADC_IN6, identifier: ADC_IN6}
- {pin_num: '5', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/FLEXIO0_D19/SmartDMA_PIO7/I3C0_PUR/CAN0_RXD/ADC1_A9, label: ADC_IN9, identifier: ADC_IN9}
- {pin_num: '24', pin_signal: P2_15/WUU0_IN21/TRIG_OUT4/LPSPI1_SDI/LPUART1_RTS_B/CT4_MAT3/CT0_MAT2/FLEXIO0_D23/SmartDMA_PIO18/OPAMP0_OUT/ADC0_A2, label: SPI_MOSI,
  identifier: SPI_MOSI}
- {pin_num: '42', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/FLEXIO0_D16/SmartDMA_PIO8/CLKOUT, label: SPI_MISO, identifier: SPI_MISO}
- {pin_num: '22', pin_signal: P2_12/WUU0_IN20/USB0_VBUS_DET/LPSPI1_SCK/LPUART1_RXD/CT4_MAT0/CT0_MAT0/FLEXIO0_D20/SmartDMA_PIO16/CAN0_RXD/ADC0_A5/OPAMP0_INP, label: SPI_SCK,
  identifier: SPI_SCK}
- {pin_num: '39', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2/FLEXIO0_D19/SmartDMA_PIO11, label: SPI_NSS, identifier: SPI_NSS}
- {pin_num: '7', pin_signal: P1_13/TRIG_IN3/LPI2C1_SCL/LPUART2_TXD/CT2_MAT3/FLEXIO0_D21/SmartDMA_PIO9/ADC1_A11, label: I2C_SCL, identifier: I2C_SCL}
- {pin_num: '6', pin_signal: P1_12/WUU0_IN12/LPI2C1_SDA/LPUART2_RXD/CT2_MAT2/FLEXIO0_D20/SmartDMA_PIO8/ADC1_A10, label: I2C_SDA, identifier: I2C_SDA}
- {pin_num: '16', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/FLEXIO0_D10/SmartDMA_PIO26/ADC0_A4/CMP0_IN0/DAC0_OUT, label: OUTPUT_DAC_PWR,
  identifier: Modbus_Master_TX;OUTPUT_DAC_PWR}
- {pin_num: '17', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/FLEXIO0_D11/SmartDMA_PIO27/ADC0_A3/CMP1_IN0/ADC1_A4, label: Modbus_Master_RX,
  identifier: Modbus_Master_RX}
- {pin_num: '18', pin_signal: P2_4/LPUART2_CTS_B/CT_INP14/CT1_MAT0/FLEXIO0_D12/SmartDMA_PIO28/ADC0_A1, label: MASTER_RS485_DE, identifier: MASTER_RS485_DE}
- {pin_num: '38', pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/PWM0_X0/FLEXIO0_D20/PWM1_A2/SmartDMA_PIO12, label: Modbus_Slave_TX, identifier: Modbus_Slave_TX}
- {pin_num: '37', pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/PWM0_X1/FLEXIO0_D21/PWM1_B2/SmartDMA_PIO13, label: Modbus_Slave_RX, identifier: Modbus_Slave_RX}
- {pin_num: '36', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/LPUART3_CTS_B/CT_INP6/PWM0_X2/FLEXIO0_D22/PWM1_A1/SmartDMA_PIO14, label: SLAVE_RS485_DE, identifier: SLAVE_RS485_DE}
- {pin_num: '33', pin_signal: P3_28/WUU0_IN26/TRIG_IN11/LPI2C3_SDA/LPUART4_RXD/CT_INP12/CT3_MAT2/FLEXIO0_D28/PWM1_B3/SmartDMA_PIO28, label: BLE_RX, identifier: BLE_RX}
- {pin_num: '21', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/FLEXIO0_D15/SmartDMA_PIO31/VREFI/ADC1_A7/ADC0_A7, label: BLE_TX, identifier: BLE_TX}
- {pin_num: '2', pin_signal: P1_8/WUU0_IN10/FREQME_CLK_IN0/LPUART1_RXD/LPI2C2_SDA/CT_INP8/CT0_MAT2/FLEXIO0_D16/SmartDMA_PIO4/I3C0_SDA, label: LCD_RS232_RX, identifier: LCD_RS232_TX;LCD_RS232_RX}
- {pin_num: '3', pin_signal: P1_9/FREQME_CLK_IN1/LPUART1_TXD/LPI2C2_SCL/CT_INP9/CT0_MAT3/FLEXIO0_D17/SmartDMA_PIO5/I3C0_SCL, label: LCD_RS232_TX, identifier: LCD_RS232_TX}
- {pin_num: '34', pin_signal: P3_27/WUU0_IN30/TRIG_OUT7/LPI2C3_SCL/LPUART4_TXD/CT_INP13/CT3_MAT1/FLEXIO0_D27/PWM1_A3/SmartDMA_PIO27, label: BLE_EN, identifier: BLE_EN}
- {pin_num: '51', pin_signal: P0_2/TDO/SWO/LPUART0_RXD/LPSPI0_SCK/CT0_MAT0/UTICK_CAP0/FLEXIO0_D2/I3C0_PUR, label: OUTPUT_KEY_O1, identifier: OUTPUT_KEY_O1}
- {pin_num: '52', pin_signal: P0_3/TDI/LPUART0_TXD/LPSPI0_SDO/CT0_MAT1/UTICK_CAP1/FLEXIO0_D3/CMP0_OUT/CMP1_IN1/ADC0_A14, label: OUTPUT_KEY_O2, identifier: OUTPUT_KEY_O2}
- {pin_num: '53', pin_signal: P0_6/ISPMODE_N/LPI2C0_HREQ/LPSPI0_PCS1/CT_INP2/FLEXIO0_D6/SmartDMA_PIO2/CMP1_OUT/CLKOUT/ADC0_A15, label: OUTPUT_KEY_O3, identifier: OUTPUT_KEY_O3}
- {pin_num: '54', pin_signal: P0_16/WUU0_IN2/LPI2C0_SDA/LPSPI0_PCS2/CT0_MAT0/UTICK_CAP2/FLEXIO0_D0/SmartDMA_PIO6/I3C0_SDA, label: OUTPUT_KEY_O4, identifier: OUTPUT_KEY_O4}
- {pin_num: '55', pin_signal: P0_17/LPI2C0_SCL/LPSPI0_PCS3/CT0_MAT1/UTICK_CAP3/FLEXIO0_D1/SmartDMA_PIO7/I3C0_SCL, label: OUTPUT_KEY_O5, identifier: OUTPUT_KEY_O5}
- {pin_num: '35', pin_signal: P3_15/LPUART2_TXD/LPUART3_RTS_B/CT_INP7/PWM0_X3/FLEXIO0_D23/PWM1_B1/SmartDMA_PIO15, label: Modbus_Master_TX, identifier: Modbus_Master_TX}
- {pin_num: '64', pin_signal: P1_6/TRIG_IN2/LPSPI0_PCS1/LPUART2_RTS_B/CT_INP6/CT4_MAT0/FLEXIO0_D14/SmartDMA_PIO2/ADC0_A22, label: INPUT_KEY2, identifier: PWM_OUT;INPUT_KEY2}
- {pin_num: '46', pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPUART3_RXD/CT_INP16/PWM0_A0/FLEXIO0_D8/PWM1_X0/SmartDMA_PIO0, label: PWM_OUT, identifier: PWM_OUT}
- {pin_num: '56', pin_signal: P1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/LPSPI0_SDO/LPI2C1_SDA/CT_INP4/CT0_MAT2/FLEXIO0_D8/ADC0_A16/CMP0_IN3, label: 'INPUT_IN1        ',
  identifier: INPUT_IN1}
- {pin_num: '57', pin_signal: P1_1/TRIG_IN1/LPSPI0_SCK/LPI2C1_SCL/CT_INP5/CT0_MAT3/FLEXIO0_D9/ADC0_A17/CMP1_IN3, label: 'INPUT_IN10       ', identifier: INPUT_IN10}
- {pin_num: '58', pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/FLEXIO0_D10/CAN0_TXD/ADC0_A18, label: 'INPUT_KEY6       ', identifier: INPUT_KEY6}
- {pin_num: '59', pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/FLEXIO0_D11/CAN0_RXD/ADC0_A19/CMP0_IN1, label: 'INPUT_KEY5       ',
  identifier: INPUT_KEY5}
- {pin_num: '62', pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/FLEXIO0_D12/SmartDMA_PIO0/ADC0_A20/CMP0_IN2, label: 'INPUT_KEY4       ',
  identifier: INPUT_KEY4}
- {pin_num: '63', pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/FLEXIO0_D13/SmartDMA_PIO1/ADC0_A21/CMP1_IN2, label: INPUT_KEY3, identifier: INPUT_KEY3}
- {pin_num: '1', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/CT4_MAT1/FLEXIO0_D15/SmartDMA_PIO3/ADC0_A23, label: 'INPUT_IN5        ', identifier: INPUT_IN5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

