sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.c
    PORT2->PCR[2] = ((PORT2->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_2 (pin 16) is configured as DAC0_OUT. */
                     | PORT_PCR_MUX(PORT2_PCR2_MUX_mux00)

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT2_3 (pin 17) is configured as LPUART2_RXD */
    PORT_SetPinMux(BOARD_INITPINS_Modbus_Master_RX_PORT, BOARD_INITPINS_Modbus_Master_RX_PIN, kPORT_MuxAlt3);

    PORT2->PCR[3] = ((PORT2->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[4] = ((PORT2->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_4 (pin 18) is configured as P2_4. */
                     | PORT_PCR_MUX(PORT2_PCR4_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[5] = ((PORT2->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_5 (pin 19) is configured as ADC1_A1. */
                     | PORT_PCR_MUX(PORT2_PCR5_MUX_mux00)

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    PORT2->PCR[6] = ((PORT2->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_6 (pin 20) is configured as ADC1_A3. */
                     | PORT_PCR_MUX(PORT2_PCR6_MUX_mux00)

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT2_7 (pin 21) is configured as LPUART4_TXD */
    PORT_SetPinMux(BOARD_INITPINS_BLE_TX_PORT, BOARD_INITPINS_BLE_TX_PIN, kPORT_MuxAlt3);

    PORT2->PCR[7] = ((PORT2->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_0 (pin 46) is configured as PWM0_A0 */
    PORT_SetPinMux(BOARD_INITPINS_PWM_OUT_PORT, BOARD_INITPINS_PWM_OUT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[0] = ((PORT3->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_12 (pin 38) is configured as LPUART3_TXD */
    PORT_SetPinMux(BOARD_INITPINS_Modbus_Slave_TX_PORT, BOARD_INITPINS_Modbus_Slave_TX_PIN, kPORT_MuxAlt3);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 37) is configured as LPUART3_RXD */
    PORT_SetPinMux(BOARD_INITPINS_Modbus_Slave_RX_PORT, BOARD_INITPINS_Modbus_Slave_RX_PIN, kPORT_MuxAlt3);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_15 (pin 35) is configured as LPUART2_TXD */
    PORT_SetPinMux(BOARD_INITPINS_Modbus_Master_TX_PORT, BOARD_INITPINS_Modbus_Master_TX_PIN, kPORT_MuxAlt2);

    PORT3->PCR[15] = ((PORT3->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_28 (pin 33) is configured as LPUART4_RXD */
    PORT_SetPinMux(BOARD_INITPINS_BLE_RX_PORT, BOARD_INITPINS_BLE_RX_PIN, kPORT_MuxAlt3);

    PORT3->PCR[28] = ((PORT3->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_8 (pin 42) is configured as LPSPI1_SDO */
    PORT_SetPinMux(BOARD_INITPINS_SPI_MISO_PORT, BOARD_INITPINS_SPI_MISO_PIN, kPORT_MuxAlt2);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    gpio_pin_config_t OUTPUT_KEY_O1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_2 (pin 51)  */
    GPIO_PinInit(BOARD_INITPINS_OUTPUT_KEY_O1_GPIO, BOARD_INITPINS_OUTPUT_KEY_O1_PIN, &OUTPUT_KEY_O1_config);

    gpio_pin_config_t OUTPUT_KEY_O2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_3 (pin 52)  */
    GPIO_PinInit(BOARD_INITPINS_OUTPUT_KEY_O2_GPIO, BOARD_INITPINS_OUTPUT_KEY_O2_PIN, &OUTPUT_KEY_O2_config);

    gpio_pin_config_t OUTPUT_KEY_O3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 53)  */
    GPIO_PinInit(BOARD_INITPINS_OUTPUT_KEY_O3_GPIO, BOARD_INITPINS_OUTPUT_KEY_O3_PIN, &OUTPUT_KEY_O3_config);

    gpio_pin_config_t OUTPUT_KEY_O4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 54)  */
    GPIO_PinInit(BOARD_INITPINS_OUTPUT_KEY_O4_GPIO, BOARD_INITPINS_OUTPUT_KEY_O4_PIN, &OUTPUT_KEY_O4_config);

    gpio_pin_config_t OUTPUT_KEY_O5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_OUTPUT_KEY_O5_GPIO, BOARD_INITPINS_OUTPUT_KEY_O5_PIN, &OUTPUT_KEY_O5_config);

    gpio_pin_config_t INPUT_IN1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_IN1_GPIO, BOARD_INITPINS_INPUT_IN1_PIN, &INPUT_IN1_config);

    gpio_pin_config_t INPUT_IN10_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_IN10_GPIO, BOARD_INITPINS_INPUT_IN10_PIN, &INPUT_IN10_config);

    gpio_pin_config_t INPUT_KEY6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_KEY6_GPIO, BOARD_INITPINS_INPUT_KEY6_PIN, &INPUT_KEY6_config);

    gpio_pin_config_t INPUT_KEY5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 59)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_KEY5_GPIO, BOARD_INITPINS_INPUT_KEY5_PIN, &INPUT_KEY5_config);

    gpio_pin_config_t INPUT_KEY4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_4 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_KEY4_GPIO, BOARD_INITPINS_INPUT_KEY4_PIN, &INPUT_KEY4_config);

    gpio_pin_config_t INPUT_KEY3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin 63)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_KEY3_GPIO, BOARD_INITPINS_INPUT_KEY3_PIN, &INPUT_KEY3_config);

    gpio_pin_config_t INPUT_KEY2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_KEY2_GPIO, BOARD_INITPINS_INPUT_KEY2_PIN, &INPUT_KEY2_config);

    gpio_pin_config_t INPUT_IN5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_IN5_GPIO, BOARD_INITPINS_INPUT_IN5_PIN, &INPUT_IN5_config);

    gpio_pin_config_t MASTER_RS485_DE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_4 (pin 18)  */
    GPIO_PinInit(BOARD_INITPINS_MASTER_RS485_DE_GPIO, BOARD_INITPINS_MASTER_RS485_DE_PIN, &MASTER_RS485_DE_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
